<?php
// Роутер
function route($method, $urlData, $formData) {
     
    // Получение информации о товаре
    // GET /goods/{goodId}
    if ($method === 'GET') {
        // Получаем id товара
 
        // Вытаскиваем товар из базы...
 
        // Выводим ответ клиенту
        echo json_encode(
            array(
                'type' => array(
                  'ladder' => 5350,
                  'mType' => 1750,
                  'pType' => 1190,
                  'gType' => 3190,
                  'fType' => 2900,
                ),
                'height' => array(
                  '300' => 1,
                  '400' => 1,
                  '500' => 1,
                  '600' => 1.07,
                  '700' => 1.14,
                  '800' => 1.21,
                  '900' => 1.28,
                  '1000' => 1.35,
                  '1100' => 1.42,
                  '1200' => 1.49,
                ),
                'width' => array(
                  '300' => 1,
                  '400' => 1,
                  '500' => 1,
                  '600' => 1.07,
                  '700' => 1.14,
                  '800' => 1.21,
                  '900' => 1.28,
                  '1000' => 1.35,
                  '1100' => 1.42,
                  '1200' => 1.49,
                ),
                'form' => array(
                  '0' => 50,
                  '1' => 550,
                  '2' => 2100,
                  '3' => 50,
                  '4' => 700,
                  '5' => 2100,
                  '6' => 0,
                  '7' => 50,
                  '8' => 2300,
                  '9' => 2300,
                  '10' => 2300,
                  '11' => 2300,
                  '12' => 2300,
                  '13' => 2300,
                  '14' => 2300,
                ),
                'energy' => array(
                  '0' => 0,
                  '1' => 3100,
                ),
                'rail' => array(
                  '0' => 1,
                  '1' => 1.13,
                ),
                'gate' => array(
                  '0' => 0,
                  '1' => 1000,
                ),
                'color' => 4000
            )
        );
        //   energy: {
        //     //	Цены на тип сушилки
        //     '0': 0, //	Водянной
        //     '1': 3100,
        //   }, //	Электрический
        //   rail: {
        //     '0': 1,
        //     '1': 1.13,
        //   }, //	Цена на группировку перемычек
        //   gate: {
        //     //	Цена для варианта подключения
        //     '0': 0, //	Универсальное
        //     '1': 1000,
        //   }, //	Боковое 110%
        //   color: 4000, //	Цена за перекраску
        // }
        return;
    }
    // Возвращаем ошибку
    header('HTTP/1.0 400 Bad Request');
    echo json_encode(array(
        'error' => 'Bad Request'
    ));
 
}
?>